<?php

/**
 * Установка времени в системе (в формате UNIX timestamp).
 * Используется для операций, связанных с временем, например, кэширования.
 */

define('TM', time());

/**
 * Шлях до виконуваного PHP-файлу відносно кореня сервера.
 * Відображає назву скрипту, який виконується.
 */

define('PHP_SELF', _filter($_SERVER['PHP_SELF']));

/**
 * Доменне ім'я або IP-адреса сервера.
 * Використовується для визначення джерела запиту.
 */

define('HTTP_HOST', _filter($_SERVER['HTTP_HOST'] ?? ''));

/**
 * Назва сервера згідно з його налаштуваннями.
 * Часто збігається з HTTP_HOST, але може використовуватись у налаштуваннях.
 */

define('SERVER_NAME', _filter($_SERVER['SERVER_NAME'] ?? ''));

/**
 * URL-адреса сторінки, з якої користувач перейшов на поточну.
 * Може бути корисною для аналітики чи перенаправлень.
 */

define('HTTP_REFERER', _filter($_SERVER['HTTP_REFERER'] ?? 'none'));

